{
    "sde": {
        "name": "SDE",
        "name2": "Software Development Engineer",
        "cover_image": "/assets/landing/sde.png",
        "bg_image": "/assets/explore/sde-home-bg.svg",
        "overview": "Before applying for any role, it’s important to understand why you want to do it and what will be required of you for this role. For a software engineering-based role, it’s necessary that you have the desire to build things from scratch, get your hands dirty with new technologies, be enthusiastic to learn new stuff all the time, and be able to apply it to new, impactful interfaces with real-time effects. If this sounds like you, then read on!",
        "readmore": "Your journey begins with a 2-3 week learning phase at the company, focused on mastering key skills like web development and APIs, tailored to your role. During this time, clear communication with your mentor is essential as they guide you through the job’s nuances. While the post-placement period might bring some pressure, the overall atmosphere remains relaxed. As a software engineer, flexible hours are a significant perk, allowing you to work when it suits you best. Typically, you'll spend 4-5 hours a day working, leaving weekends free for personal activities and time with friends.<br/><br/><b>Daily tasks</b><ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Code a part of a software application</li><li>Run tests to ensure the software works as expected</li><li>Review code from another engineer</li><li>Work on optimizing the software speed and performance</li><li>Listen to the client or company to understand what new features they want</li><li>Stay up to date on software technology and upgrades</li></ul>",
        "payscale": "Base Salary: ₹16-20 LPA<br/>CTC: ₹30-35 LPA",
        "branches": "No strict preference. Relevant courses (especially in CS, MT, and EE) are crucial. Key courses include COL100, COL106, MTL342, and MTL103",
        "skills": "Hard Skills: Strong foundation in Data Structures and Algorithms (DSA), competitive programming, and knowledge of web development or related fields.<br/>Soft Skills: Effective communication, teamwork, adaptability, and leadership",
        "trajectory": "Career stability with many professionals staying 6-20 years in the role. Growth is smooth with promotions in 1-1.5 years. Options for career progression include moving into management or continuing as a senior developer",
        "resume": "CGPA cutoff: Typically 7.5 (some companies may require 8).<br/>Key highlights: Programming assignments, especially from COL100/COL106, participation in hackathons, and self-driven projects in new tech stacks",
        "companies": "Pure SDE Roles: Google, Microsoft, Uber, Amazon, Flipkart, Facebook, Adobe, Infosys, Samsung, LinkedIn, Dell, Intuit.<br/>SDE Roles in Finance: JPMC, Morgan Stanley, Goldman Sachs.",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": ["First year. Get good hands on !! experience with !! coding in COL100", "Second year. Seek coding-related projects with  !! professors; interdisciplinary work is a !! plus", "Summer break before 3rd year. Use pre-internship summer to tackle !! hard DSA questions and study OS, !! DBMS, and other theories.", "Interview. Interviews focus on DSA; answer !! expected starting from brute force to !! optimal solutions."],
        "upwardLabels": ["Second year. Regardless of taking COL106, familiarize !! yourself with data structures and !! algorithms in any language you prefer", "Second year. Complete intermediate-level DSA !! questions by the end of 4th semester", "A month before interviews. Tests begins for different companies after !! CV shortlist (if any) May have some !! aptitude questions"],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide": {
            "html": "<div style=\"text-align: center; margin-bottom: 30px;\">\n    <h1 style=\"font-size: 32px; color: black; text-decoration: underline; font-weight: bold;\">\n        The complete guide for SDE preparation\n    </h1>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">The Process:</h2>\n    <p>Brush up your probability theory and start solving problems on Brainstellar/Puzzledquant and then move on to the books. Give plenty of time and effort before you look at the hint/solution. Intuition builds over time. You’ll be able to solve more and more problems on your own once you get the hang of it. Give Codeforces contests regularly. Remember, rating doesn’t matter much. Company-specific prep can be done towards the end of the summer (mental math, market making prep etc). Another important aspect which people miss out—HR Round is important. Do some mock interviews with your friends and seniors so you don’t get flustered during the actual interview. Look at some HR questions and prepare your answers well.</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">Probability Theory:</h2>\n    <p>MTL106 is helpful. You can also refer to <em>Introduction to Probability Models</em> by Sheldon Ross. Topics—Conditional probability, Bayes Theorem etc (JEE Stuff). Random Variables, PDF, CDF, Expected Value, Variance. Some common distributions (discrete and continuous both), Central Limit Theorem.</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">Puzzles, Probability Questions:</h2>\n    <p>Brainstellar website, Heard on the Street, <em>A Practical Guide to Quantitative Finance Interviews</em> by Xinfeng Zhao, <em>50 Challenging Problems in Probability</em>. These are the 4 standard, well-known resources (not all chapters are relevant, only probability and brainteasers). I recommend using PuzzledQuant; it helped me keep track and has a good collection of problems (Brainstellar is a subset of PuzzledQuant).</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">CP:</h2>\n    <p><a href=\"https://cses.fi/book/\" target=\"_blank\">Competitive Programmer’s Handbook</a>—a go-to guide for some new algorithm you found in an editorial, <a href=\"https://cp-algorithms.com/\" target=\"_blank\">CP-Algorithms</a> to learn about any new algorithm and its implementation.</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">C++ Concepts (more important for Quant Developer roles):</h2>\n    <p><a href=\"https://www.learncpp.com/\" target=\"_blank\">Learn C++</a></p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">Mental Math:</h2>\n    <p><a href=\"https://www.puzzledquant.com/\" target=\"_blank\">Arithmetic Game, Games | PuzzledQuant</a></p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.8; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">ML (Optional):</h2>\n    <p>If interested, you can refer to the following sections from Prof. Parag’s course <a href=\"https://www.cse.iitb.ac.in/~parags/col774/index.html\" target=\"_blank\">COL774: Machine Learning</a></p>\n    <ol>\n        <li>Supervised Learning—Linear Regression, Gradient Descent, Stochastic Gradient Descent</li>\n        <li>Linear Regression—Alternate interpretation (probabilistic), Logistic Regression, GLMs</li>\n        <li>Decision Trees, Random Forests</li>\n    </ol>\n    <p>Other resources—<a href=\"https://github.com/Aniruddha-Deb/quant-prep\" target=\"_blank\">Aniruddha-Deb/quant-prep</a>, Quant Interview/Test Prep, Internship Season | Chinmay Mittal</p>\n</div>"
          }

    

    },
    "quant": {
        "name": "Quant",
        "name2": "Quantitative Analysis",
        "cover_image": "/assets/landing/quant.png",
        "bg_image": "/assets/explore/quant-home-bg.svg",
        "overview": "Before applying for any role, it’s important to understand why you want to do it and what will be required of you for this role. A career in quantitative analysis is all about solving complex puzzles with a mix of mathematical, statistical, and programming skills. If you enjoy tackling challenging problems, analyzing data, and creating your own tools, then a Quant role might be the perfect fit for you.",
        "readmore": "As a Quant, your typical day might involve:<ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Analyzing financial data using mathematical and statistical methods.</li><li>Developing algorithms and models to predict market trends.</li><li>Writing custom tools and software to process and clean messy data.</li><li>Collaborating with team leaders to work on projects that align with the company's strategic goals.</li><li>Continuously learning and applying new techniques in fields like data analysis, probability, and game theory.</li></ul>",
        "payscale": "Median Joining Package: ₹25-35 LPA<br/>Quants typically receive higher compensation than most other fields, reflecting the high expectations and specialized skills required.",
        "branches": "Preferred branches include CS1, CS5, MT1, MT6 (also consider electrical branches). However, a strong foundation in mathematics, probability, and statistics is crucial, regardless of the branch.",
        "skills": "Exceptional coding skills, particularly in C++ and Python.<br/>Proficiency in Object-Oriented Programming, Data Analysis Techniques, and Statistical Methods.<br/>Strong problem-solving abilities, with a deep understanding of probability and game theory.",
        "trajectory": "High-pressure environments with high rewards with potential job switches after a few years or transitions to tech.<br/>Significant pay hikes and complex problem-solving opportunities for those who excel.<br/>Paths include further specialization or shifts to tech/finance roles",
        "resume": "<ul style=\"list-style: outside; margin-left: 15px;\"><li>Strong CGPA or department rank.</li><li>Projects in coding and quantitative analysis.</li><li>Competitive programming experience.</li><li>Hackathons or self-driven projects showcasing problem-solving skills.</li></ul>",
        "companies": "Elite Quant Firms: Tower Research Capital, Optiver, Jane Street, Citadel Securities, Quadeye, Alphagrep, Graviton, NK Securities.<br/>Finance Giants with Quant Roles: JP Morgan Chase, Goldman Sachs.",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": [" ", "Post 3rd Sem. Build your CV, Do projects in areas you like, find an !! internship/project for the summer, !! Participate in tech competitions to build schols", "1 month before interviews. Begin company-specific test !! preparation in shortlisted companies", " "],
        "upwardLabels": ["Thought of the Journey. Maintain a high CGPA and regularly give!! contest on codeforces", "Post 4th sem. Follow the resources mentioned for brainteasers, !! probability and programming problems", "2 weeks before interviews. HR prep, Mock interviews, !! Market Making"],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide":{
            "html": "<div style=\"font-family: 'Poppins', sans-serif; font-size: 20px;\">\n    <div style=\"text-align: center; margin-bottom: 30px;\">\n        <h1 style=\"font-size: 40px; color: black; text-decoration: underline; font-weight: bold;\">The Complete Guide for Quant preparation</h1>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">The Process:</h2>\n        <p style=\"margin-top: 0;\">Brush up your probability theory and start solving problems on Brainstellar/Puzzledquant and then move on to the books. Give plenty of time and effort before you look at the hint/solution. Intuition builds over time. You’ll be able to solve more and more problems on your own once you get the hang of it. Give Codeforces contests regularly. Remember, rating doesn’t matter much. Company-specific prep can be done towards the end of the summer (mental math, market making prep etc). Another important aspect which people miss out- HR Round is important. Do some mock interviews with your friends and seniors so you don’t get flustered during the actual interview. Look at some HR questions and prepare your answers well.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Probability Theory:</h2>\n        <p style=\"margin-top: 0;\">MTL106 is helpful. You can also refer to <em>Introduction to Probability Models</em> by Sheldon Ross. Topics- Conditional probability, Bayes Theorem etc (JEE Stuff). Random Variables, PDF, CDF, Expected Value, Variance. Some common distributions (discrete and continuous both), Central Limit Theorem.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Puzzles, Probability questions:</h2>\n        <p style=\"margin-top: 0;\">Brainstellar website, Heard on the Street, <em>A Practical Guide to Quantitative Finance Interviews</em> by Xinfeng Zhao, <em>50 Challenging Problems in Probability</em>. These are the 4 standard, well known resources (not all chapters are relevant, only probability and brainteasers). I recommend using PuzzledQuant, it helped me keep track and has a good collection of problems (brainstellar is a subset of PuzzledQuant).</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">CP:</h2>\n        <p style=\"margin-top: 0;\">Competitive Programmer’s Handbook a go-to guide for some new algorithm you found in an editorial, <a href=\"https://cp-algorithms.com/\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">CP-Algorithms</a> to learn about any new algorithm and its implementation.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">C++ Concepts (more important for Quant Developer roles):</h2>\n        <p style=\"margin-top: 0;\"><a href=\"https://www.learncpp.com/\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">Learn C++</a></p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Mental Math:</h2>\n        <p style=\"margin-top: 0;\"><a href=\"https://www.puzzledquant.com/\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">Arithmetic Game, Games | PuzzledQuant</a></p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">ML (optional):</h2>\n        <p style=\"margin-top: 0;\">If interested, you can refer to the following sections from Prof. Parag’s course <a href=\"https://www.cse.iitb.ac.in/~parags/col774/index.html\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">COL774: Machine Learning</a></p>\n        <ol style=\"margin-top: 0;\">\n            <li style=\"margin-top: 0;\">Supervised Learning- Linear Regression, Gradient Descent, Stochastic Gradient Descent</li>\n            <li style=\"margin-top: 0;\">Linear Regression - Alternate interpretation (probabilistic), Logistic Regression, GLMs</li>\n            <li style=\"margin-top: 0;\">Decision Trees, Random Forests</li>\n        </ol>\n        <p style=\"margin-top: 0;\">Other resources- <a href=\"https://github.com/Aniruddha-Deb/quant-prep\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">Aniruddha-Deb/quant-prep</a>, Quant Interview/Test Prep, Internship Season | Chinmay Mittal</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <p style=\"margin-top: 0;\">For more resources, visit <a href=\"https://github.com/anirudhakulkarni/Placements-2024\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">GitHub</a></p>\n    </div>\n</div>"
          }
          

    },
    "core": {
        "name": "Core",
        "name2": "(Electrical Engineering)",
        "cover_image": "/assets/landing/core.png",
        "bg_image": "/assets/explore/default-home-bg.svg",
        "overview": "If you have a passion for Electrical Engineering (EE) courses and enjoy hands-on circuit and chip design, a Core Electrical profile could be ideal for you. This role involves designing, simulating, and fabricating advanced circuits for various applications, such as digital processors, power electronic converters, and RF/Mixed Signal systems. If you’re excited by creating and optimizing hardware and have a keen interest in cutting-edge technology, read on!",
        "readmore": "Your role starts with designing and engineering hardware for specific applications. As you gain experience, tasks become more specialized. Key roles include Analog/RFIC/Mixed Signal Design Engineer, Digital Design Engineer, Physical Design/Verification Engineer, and Powertrain Designer. Software Engineers in this domain work with embedded systems, programming boards, and developing testing platforms. While company cultures vary, they generally offer a supportive environment with manageable stress levels. <br/><br/><b>Daily tasks</b><ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Design and optimize circuits for various applications</li><li>Simulate and test hardware components</li><li>Work on embedded systems and programming (for Software Engineers)</li><li>Collaborate with teams on complex projects</li></ul>",
        "payscale": "Base Salary: ₹20-50 LPA (varies by role and skills)<br/>Internships: ₹40K-80K per month",
        "branches": "Primarily EE, but CS, EP (in some companies), and MT students with relevant skills are also considered.",
        "skills": "Hard Skills: Circuit Design, Digital Electronics, Programming.<br/>Key courses include Digital Electronics, Circuit Theory, Control Systems, and Analog Electronic Circuits",
        "trajectory": "Career growth starts gradually but becomes highly rewarding with experience. Engineers often advance to lead roles within 8-10 years.<br/>The expanding semiconductor industry in India offers stable and lucrative long-term career opportunities.",
        "resume": "<ul style=\"list-style: outside; margin-left: 15px;\"><li>Relevant EE projects and internships (research or corporate)</li><li>CGPA of 7-7.5+ is generally sufficient; some companies may require 8+.</li><li>Strong technical knowledge and relevant projects are prioritized over extracurricular activities.</li></ul>",
        "companies": "Nvidia, Texas Instruments, Qualcomm, Intel, Jaguar, Land Rover, MediaTek, Cadence",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": [" ", "Post 4th Sem. Corporate or research intern, !! preferably in the manufacturing !! sector", "Prior to Day 1. Revisit your journey from childhood to IIT, your !! hobbies and any life changing events (these get !! asked a lot in interviews). Also revisit !! coursework and attempt mock aptitude tests", " "],
        "upwardLabels": ["Prior to 4th Sem. Boost CG as much as possible !! !!", "4th Sem. Take up project work either included !! in course, or led by a professor", " Day 1 of Interviews. !! !!"],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide": {
            "html": "<div style=\"font-family: 'Poppins', sans-serif; font-size: 20px;\">\n    <div style=\"text-align: center; margin-bottom: 30px;\">\n        <h1 style=\"font-size: 40px; color: black; text-decoration: underline; font-weight: bold;\">The Complete Guide for Core preparation</h1>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Process Overview</h2>\n        <p style=\"margin-top: 0;\">The selection process for an FMCG internship typically involves three to four rounds:</p>\n        <ul style=\"margin-top: 0;\">\n            <li style=\"margin-top: 0;\">\n                <strong style=\"font-weight: bold;\">Application Stage:</strong> Fill out a form detailing your internships, academic achievements, and skills. Highlight relevant experiences and ensure your details are precise since this forms the company’s first impression of you. Some companies also include a psychometric test to assess personality traits and cultural fit. Treat this test as a chance to showcase your authenticity—don’t overthink your answers.\n            </li>\n            <li style=\"margin-top: 0;\">\n                <strong style=\"font-weight: bold;\">Group Discussion (GD):</strong> Emphasis on quality over quantity. Focus on contributing meaningfully to the discussion rather than dominating it. Structure your thoughts before speaking and encourage quieter members to participate. This demonstrates teamwork and improves the overall discussion quality.\n            </li>\n            <li style=\"margin-top: 0;\">\n                <strong style=\"font-weight: bold;\">Interview Stage:</strong>\n                <ul style=\"margin-top: 0;\">\n                    <li style=\"margin-top: 0;\">\n                        <strong style=\"font-weight: bold;\">Technical Round:</strong> This assesses your understanding of key concepts and the projects listed on your resume. Be clear and concise in your answers and prepare for follow-up questions.\n                    </li>\n                    <li style=\"margin-top: 0;\">\n                        <strong style=\"font-weight: bold;\">HR Round:</strong> This evaluates your fit for the company and role. Expect questions about your strengths, weaknesses, and past experiences.\n                    </li>\n                </ul>\n            </li>\n        </ul>\n        <p style=\"margin-top: 0;\">Throughout the process, be confident, know your CV thoroughly, and stay calm under pressure.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Building an Effective CV</h2>\n        <p style=\"margin-top: 0;\">Your CV is a crucial part of the application process. Here’s how your CV shapes up -</p>\n        <ul style=\"margin-top: 0;\">\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">Academic Background:</strong> Include your 10th and 12th-grade marks, competitive exam achievements (e.g., NTSE, KVPY, JEE ranks), and relevant certifications.</li>\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">CGPA:</strong> Most FMCG companies require a CGPA of 7-7.5. Companies like Wipro prefer 8+. A strong CGPA enhances your CV, but exceptional internships and projects can compensate for a lower score.</li>\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">Internships:</strong> Prefer industry-relevant internships such as those in manufacturing roles. SURA projects or AI/ML internships can make your profile stand out.</li>\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">Projects:</strong> Include diverse and impactful projects such as COL Projects or Department projects to showcase versatility.</li>\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">PORs and ECAs:</strong> Emphasize positions of responsibility and continued involvement in clubs/activities to reflect growth and commitment.</li>\n            <li style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">Relevant Courses:</strong> List courses aligned with the FMCG industry.</li>\n        </ul>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Building your profile during 3rd and 4th Semesters</h2>\n        <p style=\"margin-top: 0;\">Approach professors for research projects. Complete internships in relevant areas to gain practical experience and do AI/ML projects to differentiate yourselves among applicants. At the same time, strengthen your understanding of core concepts relevant to the FMCG domain, such as supply chain operations or data analytics. This balance of practical experience and strong fundamentals will give you an edge in the selection process.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Interview Tips</h2>\n        <p style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">Technical Round:</strong> Be concise and prepared to explain your listed projects and internships in detail. If a question seems unclear, ask for clarification and steer the conversation toward your strengths. Be prepared to explain every point and link it to the role you’re applying for.</p>\n        <p style=\"margin-top: 0;\"><strong style=\"font-weight: bold;\">HR Round:</strong> Create a brief but compelling self-introduction. Highlight academic interests, leadership roles, and experiences, connecting them to the company’s vision and the role you’re applying for. Stay calm and ask insightful questions about the role or company. Confidence and calmness can make a significant difference, especially when dealing with challenging questions.</p>\n    </div>\n</div>"
          }
          
    },
    "finance": {
        "name": "Finance",
        "name2": "(Analytics)",
        "cover_image": "/assets/landing/quant.png",
        "bg_image": "/assets/explore/quant-home-bg.svg",
        "overview": "A career in finance involves managing and analyzing financial data, making strategic decisions, and helping businesses achieve their financial goals. Whether you're interested in investment banking, private equity, or finance within a tech company, understanding the demands and rewards of the field is crucial. If you’re ready for a challenging yet rewarding career with diverse opportunities, finance might be the right fit for you!",
        "readmore": "In finance, daily activities vary based on the specific role. In investment banking, expect long hours (80-100 per week) dealing with high-stakes deals and rigorous analyses. Private equity roles involve around 80 hours a week, with more intensive periods during active deals. Finance roles in tech companies generally offer a better work-life balance, with 40-50 hours a week. The day involves reviewing financial reports, conducting market analysis, and preparing presentations for stakeholders. The role demands strong analytical skills, attention to detail, and adaptability to fast-paced environments.<br/><br/><b>Daily Tasks</b><ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Analyze financial data and create financial models</li><li>Prepare and present reports to senior management</li><li>Monitor market trends and financial performance</li><li>Collaborate with other departments and clients</li></ul>",
        "payscale": "Joining PayScale: ₹10-30 LPA (varies by role and company)",
        "branches": "No specific branch preference; relevant coursework and experience are more important.",
        "skills": "Hard Skills: Strong analytical and quantitative skills, and knowledge of programming languages.<br/>Soft Skills: Analytical thinking and effective communication",
        "trajectory": "The finance sector in India is growing, with increasing economic activity and foreign investments. Career prospects are strong, with opportunities for advancement into senior roles or specializations in areas like investment banking or private equity.",
        "resume": "<ul style=\"list-style: outside; margin-left: 15px;\"><li>Strong CGPA</li><li>Finance-related projects and coursework</li><li>Relevant internships or work experience</li></ul>",
        "companies": "Goldman Sachs, Morgan Stanley, American Express, NK Securities, J.P. Morgan Chase, Barclays, DMI Finance, Alphagrep Securities, Piramal, Quadria",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": ["aa ","Resources", "Coding Round", "Interview"],
        "upwardLabels": ["", "Mock Interviews", "Final Prep"],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide": {
    "title": "The complete guide for SDE preparation",
    "sections": [
        {
            "heading": "The Process",
            "content": "Brush up your probability theory and start solving problems on Brainstellar/Puzzledquant..."
        },
        {
            "heading": "Probability Theory",
            "content": "MTLI06 is helpful. You can also refer to Introduction to Probability Models by Sheldon Ross..."
        },
        {
            "heading": "Puzzles, Probability questions",
            "content": "Brainstellar website, Heard on the Street, A Practical Guide to Quantitative Finance Interviews..."
        },
        {
            "heading": "CP",
            "content": "Competitive Programmer’s Handbook a go-to guide for some new algorithm you found in an editorial..."
        }
    ],
    "html": "<div style=\"text-align: center; margin-bottom: 20px;\">\n    <h1 style=\"font-size: 40px; color: black; text-decoration: underline;\">The complete guide for SDE preparation</h1>\n</div>\n<div style=\"font-size: 16px; line-height: 1.5; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">The Process:</h2>\n    <p>Brush up your probability theory and start solving problems on platforms like LeetCode, HackerRank, etc.</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.5; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">Probability Theory:</h2>\n    <p>MTLI06 is helpful. You can also refer to <em>Introduction to Probability Models</em>.</p>\n</div>"
}

        
    },
    "ai-ml": {
        "name": "AI/ML",
        "name2": "Artificial Intelligence/Machine Learning",
        "cover_image": "/assets/landing/ai-ml.png",
        "bg_image": "/assets/explore/default-home-bg.svg",
        "overview": "If you’re fascinated by algorithms, data, and the transformative power of AI/ML, you’re in the right place. AI/ML roles involve developing advanced algorithms, creating intelligent systems, and enhancing decision-making processes through data. This field offers a mix of theoretical and practical challenges, perfect for those eager to solve real-world problems with cutting-edge technology.",
        "readmore": "In AI/ML, your journey starts with grasping foundational concepts and applying them to practical problems. For beginners, start with online resources like Coursera’s Deep Learning Specialization and courses like COL774 for advanced mathematical insights. Practice your skills on platforms like Kaggle, engage with deep learning concepts through blogs and courses, and work on projects with professors or companies. Projects offer hands-on experience, which is crucial for deep learning and AI research.<br/><br/><b>Daily Tasks</b><ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Researchers<ul style=\"list-style: circle outside; margin-left: 15px; margin-left:15px\">\t<li>Review latest papers and advancements</li><li>Conduct literature surveys and team meetings</li><li>Design, code, and refine experiments using Python libraries (e.g., TensorFlow, PyTorch)</li><li>Analyze results to improve models and algorithms</li></ul></li><li>Industry Experts</li><ul style=\"list-style: circle outside; margin-left: 15px; margin-left:15px\"><li>Focus on coding and implementing AI/ML systems</li><li>Develop and optimize AI models for practical applications</li><li>Less emphasis on literature reviews, more on real-world problem-solving</li></ul></ul>",
        "payscale": "Median Joining Package: Data varies; typically high in leading tech companies and research institutions.",
        "branches": "Research Roles: MT, CS, EE<br/>Application Roles: Open to all branches, though MT/CS/EE students might be preferred for core ML research.",
        "skills": "Hard Skills: Deep Learning, Large Language Models (LLMs), Optimization, Machine Learning, Linear Algebra, Python",
        "trajectory": "AI/ML careers offer rapid growth and substantial rewards. As you gain experience, you’ll have opportunities to lead projects, drive innovation, and influence AI strategies in diverse fields like healthcare, finance, and autonomous systems.",
        "resume": "<ul style=\"list-style: outside; margin-left: 15px;\"><li>Projects in AI/ML</li><li>Strong CGPA and department rank</li></ul>",
        "companies": "Industry Leaders: Google DeepMind, OpenAI, IBM Watson, Amazon AI, Facebook AI Research (FAIR), NVIDIA AI, Microsoft AI and Research",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": ["Intro", "Resources", "Coding Round", "Interview"],
        "upwardLabels": ["Resume", "Mock Interviews", "Final Prep"],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide": {
    "title": "The complete guide for SDE preparation",
    "sections": [
        {
            "heading": "The Process",
            "content": "Brush up your probability theory and start solving problems on Brainstellar/Puzzledquant..."
        },
        {
            "heading": "Probability Theory",
            "content": "MTLI06 is helpful. You can also refer to Introduction to Probability Models by Sheldon Ross..."
        },
        {
            "heading": "Puzzles, Probability questions",
            "content": "Brainstellar website, Heard on the Street, A Practical Guide to Quantitative Finance Interviews..."
        },
        {
            "heading": "CP",
            "content": "Competitive Programmer’s Handbook a go-to guide for some new algorithm you found in an editorial..."
        }
    ],
    "html": "<div style=\"text-align: center; margin-bottom: 20px;\">\n    <h1 style=\"font-size: 40px; color: black; text-decoration: underline;\">The complete guide for SDE preparation</h1>\n</div>\n<div style=\"font-size: 16px; line-height: 1.5; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">The Process:</h2>\n    <p>Brush up your probability theory and start solving problems on platforms like LeetCode, HackerRank, etc.</p>\n</div>\n<div style=\"font-size: 16px; line-height: 1.5; margin-bottom: 20px;\">\n    <h2 style=\"font-size: 20px; font-weight: bold; margin-bottom: 10px;\">Probability Theory:</h2>\n    <p>MTLI06 is helpful. You can also refer to <em>Introduction to Probability Models</em>.</p>\n</div>"
}

    },
    "consult": {
        "name": "Consulting",
        "name2": "",
        "cover_image": "/assets/landing/consult.png",
        "bg_image": "/assets/explore/consult-home-bg.svg",
        "overview": "If you’re interested in solving complex business problems, working with diverse teams, and influencing organizational decisions, a career in consulting might be the right path for you. Consulting involves advising companies on a variety of issues, from strategy and operations to finance and technology.",
        "readmore": "Your journey typically begins with rigorous training in core consulting skills, such as problem structuring, data analysis, and client management. You'll quickly get involved in client-facing projects, where you’ll apply your skills to solve real business challenges.<br/>Do talk to your seniors in this area before deciding upon consulting to learn the pros and the cons of the profile. For instance, it’s know for a heavy workload and an often difficult work-life balance but offers an exceptional career growth potential.<br/><br/><b>Daily Tasks</b><ul style=\"list-style: outside; margin-left: 15px; text-align:left\"><li>Analyzing data to identify trends and insights (Working on a lot of excel sheets and powerpoints)</li><li>Developing strategies and recommendations based on market research and analysis.</li><li>Preparing and delivering presentations to clients.</li><li>Working closely with client teams to implement solutions.</li></ul>",
        "payscale": "Average Internship Stipend: 1,00,000 Rs.<br/>Base Salary: ₹20-25 LPA<br/>Tend to pay lesser than other profiles initially but offer a very steep salary increase",
        "branches": "No specific branch preference. DR’s of any branch are preferred, CG matters",
        "skills": "Soft Skills - Management skills, Communication skills, Leadership skills, Problem Solving<br/>Hard Skills - Excel, Teams, Data Analysis, Presentation Tools, Project Management",
        "trajectory": "A career in consulting offers a structured yet dynamic growth path, typically starting with entry-level roles like Analyst or Associate Consultant. With experience and strong performance, you can expect promotions every 1-2 years in the early stages, advancing through roles such as Consultant, Senior Consultant, and Manager.<br/>Most consultants opt out of consulting in a few years. There are a lot of exit options - startups, private equity, management roles, MBAs etc",
        "resume": "There is a CV shortlisting in consulting roles which is a huge bottleneck as students apply. 20-30 shortlists are made (might vary with company) who would be eligible for further rounds. Hence making a good CV is very important.<br/>A consulting CV has 5 section<ul style=\"list-style: outside; margin-left: 15px;\"><li>CG</li><li>Scholastic Achievememts</li><li>Internship (Startup/Research/Corporate)</li><li>POR</li><li>ECA</li></ul>When a  section of your CV is above average, its known as a ‘spike’. Generally, you should be shortlisted if you have at least 3-4 ‘spikes’ among the 5 sections.<br/>We advise you to have a talk with your seniors or see the BSW Podcasts to understand the CV Building procedure in detail.",
        "companies": "McKinsey & Company, Boston Consulting Group (BCG), Bain & Company, LEK Consulting, Strategy&, Kearney, Accenture, Nomura, KPMG",
        "videoLinks" : [ "../../assets/Build/Quant.mp4", "../../assets/Build/Quant.mp4"],
        "downwardLabels": ["Start shaping your CV. convey !! the story you want! !! Look to achieve ‘spikes’.", "Post 4th Sem. Completcorporate/startup/ !! foreign internships. !! Start reaching out during 4th Sem", "Shortly after shortlists. Buddies are assigned; !! buddy cases begin", " "],
        "upwardLabels": ["Post 3rd Sem. Complete internship/project to boost CV. !! Start reaching out for one timely", "1-2 months before interviews. Form case group and start !! practicing cases", " Day 1 of Interviews. !! !! "],
        "question" : ["1", "2", "3", "4", "5", "6"],
        "questions" : ["1", "2", "3", "4", "5", "6"],
        "timestamps" : ["00:05", "00:35", "00:55", "01:05", "00:10","01:10"],
        "guide" :{
            "html": "<div style=\"font-family: 'Poppins', sans-serif; font-size: 20px;\">\n    <div style=\"text-align: center; margin-bottom: 30px;\">\n        <h1 style=\"font-size: 40px; color: black; text-decoration: underline; font-weight: bold;\">The complete guide for Consulting preparation</h1>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Process Overview:</h2>\n        <p style=\"margin-top: 0;\">The selection process for consulting internships consists of three main stages: CV Shortlisting, Buddy Rounds, and Offline Interviews. CV shortlisting is by far the biggest bottleneck, where ~50 unique students are shortlisted from a pool of 500+ applicants. As such, preparing a standout CV is crucial. Begin working on your CV early to allow sufficient time for refinement and development. Your CV should tell a compelling story about your achievements and experiences.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Building Your CV:</h2>\n        <p style=\"margin-top: 0;\">A consulting CV typically comprises five sections: CG, Scholastic Achievements, Internships, PORs, and ECAs. A consulting CV is judged via the ‘spike’ framework. A ‘spike’ section is one where you’re well above the average applicant. It is the section that stands out to the person evaluating your CV. Although there is some subjectivity to what you call a spike, being well above average in atleast 3-4 sections is non-negotiable for a shortlist among the top firms.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">CG:</h2>\n        <p style=\"margin-top: 0;\">Generally top firms consider CG above 8 to be satisfactory, some firms have also put hard barriers in the past. A CG above 8.5 or 9 is an ideal spike. A lower CG makes getting shortlisted tougher but can be compensated by excelling in other sections. (Note: These numbers are subject to the relative performance of the applicants in a particular batch)</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Schols:</h2>\n        <p style=\"margin-top: 0;\">This section includes institute-level awards such as Merit List, Department Rank, and pre-institute achievements like Olympiad ranks or scholarships. If this section of yours is lacking, don’t worry, with some conscious effort you can build your section up to a satisfactory level.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Internships:</h2>\n        <p style=\"margin-top: 0;\">These include corporate, start-up and research interns (offline/online). It is highly advised to complete multiple internships. Internships in big brand corporations or business schools are valued. An offline intern at a well-established corporate (even more impactful if it is in the consulting sector) or at a foreign research institute are considered as particularly great options. These can be coupled with a remote intern at a business school, which is usually a significantly less time commitment.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">PORs:</h2>\n        <p style=\"margin-top: 0;\">This section conveys the story of your campus involvements over the course of two years. Continuity in POR’s is hence valued, indicating progress in whatever activity you’ve devoted time to. 3rd year POR’s are important. Elected POR’s are generally considered more valuable than nominated POR’s.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">ECAs:</h2>\n        <p style=\"margin-top: 0;\">Organize your ECAs into 2-3 broad sections to provide structure. Having multiple ECA’s in a few select sections shows excellence and dedication as opposed to having them scattered across various sections. Ensure that the most valuable achievements are presented well to make your CV stand out.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Buddy Rounds:</h2>\n        <p style=\"margin-top: 0;\">Once you are shortlisted, the firm will allot you buddies. A buddy is a consultant working at the firm and is usually an alum of the institute. Buddies will conduct case solving sessions with you, guiding you through your preparation. These sessions are evaluative, with firms using them to create a “hotlist” of preferred candidates. Although not being on the hotlist does not eliminate your chances, performing well in these rounds increases your likelihood of being prioritized.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Case Prep:</h2>\n        <p style=\"margin-top: 0;\">Form a Case Group: Work with 3-4 serious aspirants who have diverse networks. This allows you to access varied insights and resources. Case groups help maintain regular practice but also seek opportunities to practice with seniors and peers outside your group. You can start practicing cases 1-2 months before your interviews ensuring you’re at your peak during the interviews and senior buddy cases. Start with guesstimates and profitability, while aiming to cover other types of cases towards the end of your prep. Practice in pairs, taking turns as interviewer and interviewee. After each case, spend time analyzing your performance and building a deeper understanding of frameworks and solutions.</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <h2 style=\"font-size: 20px; font-weight: bold; margin-top: 0;\">Resources:</h2>\n        <p style=\"margin-top: 0;\">A conventionally followed method to begin is getting an overview of case preps via the recorded lectures of Victor Cheng and Case Interviews Cracked: <a href=\"https://www.youtube.com/playlist?list=PLRfC6rXAvJzcp_bkNMbbMgRm0gER0fbr2\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">YouTube Playlist</a>, <a href=\"https://www.youtube.com/playlist?list=PLRfC6rXAvJzcp_bkNMbbMgRm0gER0fbr2\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">YouTube Playlist</a> (stick to the first few relevant lectures)</p>\n    </div>\n    <div style=\"font-size: 20px; line-height: 1.8; margin-bottom: 20px;\">\n        <p style=\"margin-top: 0;\">Case Compendium (a good beginner-friendly option), Case Interviews Cracked and IIM Ahmedabad Case Book (slightly more advanced than the former) are some conventional case books used by applicants. <a href=\"https://owncloud.iitd.ac.in/nextcloud/index.php/s/q97gkNsXzyC5wik?dir=undefined&openfile=12489832\" style=\"color: blue; text-decoration: underline;\" target=\"_blank\">Download here</a></p>\n    </div>\n</div>"
          }
          
          
          
          
          
          
          
          
          
          

    
    }
}
